; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v4 ?v11)
             (pred_12 ?v12 ?v8)
             (pred_3 ?v4 ?v8)
             (pred_9 ?v7 ?v4 )
	     (pred_8 ?v4)
             (pred_11 ?v13)
             (pred_6 ?v12)
             (pred_4 ?v8)
             (pred_1 ?v4)
             (pred_2 ?v12)
             (pred_10 ?v4)
             (pred_5 ))



(:action op_1
:parameters (?v1 ?v2 ?v3 ?v6)
:precondition (and (pred_11 ?v1) (pred_11 ?v2) (pred_6 ?v3) (pred_4 ?v6)
          (pred_7 ?v1 ?v2) (pred_12 ?v3 ?v6)
                   (pred_3 ?v2 ?v6) (pred_8 ?v1) 
                   (pred_1 ?v2) (pred_2 ?v3))
:effect (and  (pred_10 ?v2) (not (pred_1 ?v2))))


(:action op_5
:parameters (?v1 ?v9)
:precondition (and (pred_11 ?v1) (pred_11 ?v9)
               (pred_8 ?v1) (pred_7 ?v1 ?v9) (pred_10 ?v9))
:effect (and (pred_8 ?v9) (not (pred_8 ?v1))))

(:action op_4
:parameters (?v1 ?v3)
:precondition (and (pred_11 ?v1) (pred_6 ?v3) 
                  (pred_8 ?v1) (pred_9 ?v3 ?v1) (pred_5 ))
:effect (and (pred_2 ?v3)
   (not (pred_9 ?v3 ?v1)) (not (pred_5 ))))


(:action op_3
:parameters (?v1 ?v5 ?v10)
:precondition (and (pred_11 ?v1) (pred_6 ?v5) (pred_6 ?v10)
                  (pred_8 ?v1) (pred_2 ?v10) (pred_9 ?v5 ?v1))
:effect (and (pred_2 ?v5) (pred_9 ?v10 ?v1)
        (not (pred_2 ?v10)) (not (pred_9 ?v5 ?v1))))

(:action op_2
:parameters (?v1 ?v3)
:precondition (and (pred_11 ?v1) (pred_6 ?v3) 
                  (pred_8 ?v1) (pred_2 ?v3))
:effect (and (pred_5 ) (pred_9 ?v3 ?v1) (not (pred_2 ?v3)))))

; problem
(define (problem grid-2-2-1-1-1)
    (:domain grid)
    (:objects
    obj_03 obj_02 obj_05 obj_06
    obj_01
    obj_04
    )

    (:init
       (pred_5)

       (pred_11 obj_03)
       (pred_11 obj_02)
       (pred_11 obj_05)
       (pred_11 obj_06)
       (pred_4 obj_01)
       (pred_6 obj_04)

       (pred_7 obj_03 obj_05)
       (pred_7 obj_03 obj_02)
       (pred_7 obj_02 obj_06)
       (pred_7 obj_02 obj_03)
       (pred_7 obj_05 obj_06)
       (pred_7 obj_05 obj_03)
       (pred_7 obj_06 obj_02)
       (pred_7 obj_06 obj_05)
       (pred_1 obj_03)
       (pred_3  obj_03 obj_01)
       (pred_10 obj_02)
       (pred_10 obj_05)
       (pred_10 obj_06)

       (pred_12  obj_04 obj_01)
       (pred_9 obj_04 obj_06)
       (pred_8 obj_05)
    )

    (:goal (and
       (pred_9 obj_04 obj_03)
    ))
(:constraints
  (always (not (pred_8 obj_02)))
)
)

; plan
1. (op_5 obj_05 obj_06)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_06)
   goals met: 0 of 1
2. (op_4 obj_06 obj_04)
   deleted: (pred_9 obj_04 obj_06) (pred_5)
   added: (pred_2 obj_04)
   goals met: 0 of 1
3. (op_5 obj_06 obj_05)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_05)
   goals met: 0 of 1
4. (op_1 obj_05 obj_03 obj_04 obj_01)
   deleted: (pred_1 obj_03)
   added: (pred_10 obj_03)
   goals met: 0 of 1
5. (op_5 obj_05 obj_03)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_03)
   goals met: 0 of 1
6. (op_2 obj_03 obj_04)
   deleted: (pred_2 obj_04)
   added: (pred_5) (pred_9 obj_04 obj_03)
   goals met: 1 of 1
